{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "disgust",
    "1": "embarrassment",
    "2": "joy",
    "3": "neutral",
    "4": "pride",
    "5": "serious"
  },
  "initializer_range": 0.02,
  "label2id": {
    "disgust": 0,
    "embarrassment": 1,
    "joy": 2,
    "neutral": 3,
    "pride": 4,
    "serious": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "vocab_size": 30522
}
